practice-for-ch-rails-first-routes-long-practice-main/FirstRoutes/app/controllers/artworks_controller.rb

    def index
        user_id = params[:user_id]
        user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "hawl"], ["image_url", "www.gronk.com"], ["artist_id", 3], ["updated_at", "2023-08-03 20:09:57.077325"], ["id", 2]]